Curso_CFD_OS_2019/Couette/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       2320;
    }
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       2380;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       2400;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       2420;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2400;
        startFace       2480;
    }
)

// ************************************************************************* //
